bookers/app/views/books/index.html.erb

SELECT "books".* FROM "books"
---
              <td>
                <p>コメント数： <%= @book.book_comments.count %></p>