bookers/app/controllers/books_controller.rb

INSERT INTO "books" ("title", "body", "user_id", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?)  [["title", "j"], ["body", "jj"], ["user_id", 5], ["created_at", "2021-08-25 01:30:45.434417"], ["updated_at", "2021-08-25 01:30:45.434417"]]
SELECT "books".* FROM "books"
---
  def create
    @book = Book.new(book_params)
    @book.user_id = current_user.id
    if @book.save
      redirect_to book_path(@book), notice: "You have created book successfully."
    else
      @books = Book.all